psabela/spi/STM32U585_LoRa2_TEST/Core/Src/main.c
#include <stdio.h>
#include <stdint.h>
#include "stm32u585xx.h"
#include "core_cm33.h"
#include "rcc_assembly.h"
#include "gpio_assembly.h"
#include "spi_master_assembly.h"
#include "nvic_assembly.h"
#include "tim8_assembly.h"
#include "exti_assembly.h"

void RCC_init(void);
void GPIO_SPI_init(void);
void SPI_init(void);
void DIO_EXTI_init(void);
void TIM8_init(void);
void SPI_start(void);
void TIM8_start(void);
void NVIC_Interupts_Enable(void);

int _write(int file, char *ptr, int len){
	for(int i = 0; i < len; i++){
		ITM_SendChar(*ptr++);
	}
	return len;
}
/* USER CODE BEGIN 0 */
int __io_putchar(int ch){
	ITM_SendChar(ch);
	return ch;
}

uint8_t SetStandby[] 			= {0x0A, 0x00};  //STDBY_RC = 0; STDBY_XOSC = 1
uint8_t SetPacketType[] 		= {0x8A, 0x01}; //PACKET_TYPE_LoRa 0x01 LoRa mode
uint8_t SetModulationParams[] 	= {0x8B, 0x0C, 0x04, 0x04, 0x00}; //0x07==SF7 | 0x04==125kHz | 0x01==LoRa_CR_4_5
uint8_t SetPacketParams[] 		= {0x8C, 0x00, 0x0C, 0x00, 0x05, 0x01, 0x00}; //Preamble MSB=0x00 LSB=0x0C (12) | Header-0x00 | Len=0x05 | CRC=0x01(on) | IQ=0x00(std)
uint8_t SetTxParams[] 			= {0x8E, 0x0E, 0x04};  //0x0E==14dBm | 0x04==SET_RAMP_200U
uint8_t SetRfFrequency[] 		= {0x86, 0x39, 0x2E, 0x66, 0x66};
uint8_t syncWord1[]  			= {0x0d, 0x07, 0x40, 0x14};	//MSB 0x14 //Set Sync Word (private network: 0x1424) //WriteRegister opcode 0x0D, address 0x0740 (2bytes)
uint8_t syncWord2[]  			= {0x0d, 0x07, 0x41, 0x24};	//MSB 0x24
uint8_t SetBufferBaseAddress[]  = {0x8F, 0x00, 0x00};
uint8_t SetPaConfig[] 			= {0x95, 0x02, 0x03, 0x00, 0x01};
uint8_t WriteBuffer[] 			= {0x0E, 0x00, 0x50, 0x45, 0x54, 0x45, 0x52};
uint8_t SetTx[] 				= {0x83, 0x00, 0x00, 0x00};
uint8_t SetDioIrqParams[]       = {0x08, 0x00, 0x01, 0x00, 0x01, 0x00, 0x00, 0x00, 0x00};  //x
uint8_t GetIrqStatus[] 		    = {0x12, 0x00, 0x00, 0x00};
uint8_t ClearIrqStatus[]        = {0x02, 0xFF, 0xFF};

volatile int cmd = 0;
uint8_t tsize = 0;
volatile uint8_t	cmd_index;
uint8_t *command;

//volatile uint8_t SetCadParams[] = {0x88, power, rampTime, 99};
//volatile uint8_t SetLoRaSymbNumTimeout[] = {0xA0, power, rampTime, 99};

volatile uint32_t timer_pulse;
volatile uint32_t slave_ready;
volatile uint8_t  byte_index = 0;
volatile uint32_t  rx_buffer;
volatile uint32_t  tx_buffer;
volatile int _counter = 0;

int main(void){
	timer_pulse = 0;
	cmd_index = 0;
	slave_ready = 2;
	RCC_init();
	//TIM8_init();
	//GPIO_SPI_init();
	DIO_EXTI_init();
	//SPI_init();
	//starting interrupt handlers
	//NVIC_IPR6_EXTI15_priority();
	//NVIC_TIM8_Enable_Interupt();
	NVIC_EXTI15_Enable_Interupt();
	//TIM8_start();
	//SubmitCommand(cmd_index);
	while(1){}
}

void SubmitCommand(cmd_index){
	printf("%d...", cmd_index);

	if(cmd_index == 0){
		printf("SetStandby...sending.\n");
		lora_command(SetStandby, (uint8_t)sizeof(SetStandby));
	}
	else if(cmd_index == 1){
		printf("SetPacketType...sending.\n");
		lora_command(SetPacketType, (uint8_t)sizeof(SetPacketType));
	}
	else if(cmd_index == 2){
		printf("SetRfFrequency...sending.\n");
		lora_command(SetRfFrequency, (uint8_t)sizeof(SetRfFrequency));
	}
	else if(cmd_index == 3){
		printf("SetPaConfig...sending.\n");
		lora_command(SetPaConfig, (uint8_t)sizeof(SetPaConfig));
	}
	else if(cmd_index == 4){
		printf("SetTxParams...sending.\n");
		lora_command(SetTxParams, (uint8_t)sizeof(SetTxParams));
	}
	else if(cmd_index == 5){
		printf("SetBufferBaseAddress...sending.\n");
		lora_command(SetBufferBaseAddress, (uint8_t)sizeof(SetBufferBaseAddress));
	}
	else if(cmd_index == 6){
		printf("SetModulationParams...sending.\n");
		lora_command(SetModulationParams, (uint8_t)sizeof(SetModulationParams));
	}
	else if(cmd_index == 7){
		printf("SetPacketParams...sending.\n");
		lora_command(SetPacketParams, (uint8_t)sizeof(SetPacketParams));
	}
	else if(cmd_index == 8){
		printf("syncWord1...sending.\n");
		lora_command(syncWord1, (uint8_t)sizeof(syncWord1));
	}
	else if(cmd_index == 9){
		printf("syncWord2...sending.\n");
		lora_command(syncWord2, (uint8_t)sizeof(syncWord2));
	}
	else if(cmd_index == 10){
		printf("ClearIrqStatus...sending.\n");
		lora_command(ClearIrqStatus, (uint8_t)sizeof(ClearIrqStatus));
	}
	else if(cmd_index == 11){
		printf("SetDioIrqParams...sending.\n");
		lora_command(SetDioIrqParams, (uint8_t)sizeof(SetDioIrqParams));
	}
	else if(cmd_index == 12){
		printf("WriteBuffer...sending.\n");
		lora_command(WriteBuffer, (uint8_t)sizeof(WriteBuffer));
	}
	else if(cmd_index == 13){
		printf("SetTx...sending.\n");
		lora_command(SetTx, (uint8_t)sizeof(SetTx));
	}
	else{
		printf("...completed....\n");
		return;
	}
}

void lora_command(uint8_t *cmd, uint8_t cmd_len){

	tsize   = cmd_len;  //tsize limit < 65535
	command = cmd;
	//set spe = 1
	ASM_SPI_CR1_SPE_0();
	ASM_SPI_CFG1_FTHLV(tsize-1);
	ASM_SPI_CR2_TSIZE(tsize);
	ASM_SPI_CR1_SPE_1();
	GPIOE_BSRR_NSS_RESET();  //LOW
	for(volatile int i=0; i<100; i++);	//PAUSE
	NVIC_SPI1_Enable_Interupt();
}

void SPI1_IRQHandler(){

	if(ASM_SPI_SR_Get() & (0x1U << 3)){
		//printf("EOT: end of transfer. 1: transfer complete.\n");
		ASM_SPI_IFCR_EOTC_Clear();
		for(volatile int i=0; i<200; i++);	//PAUSE
		GPIOE_BSRR_NSS_SET(); //HIGH
		for(volatile int i=0; i<200; i++);	//PAUSE
		if(cmd_index < 14){
			SubmitCommand(cmd_index);
		}
	}

	if(ASM_SPI_SR_Get() & (0x1U << 1)){
		//printf("TXP: Data packet space available\n");

		while(GPIOC_IDR_RDY_GET() == 2){} //wait until ready
		//pre-load first byte of the command
		tx_buffer = ASM_SPI_TXDR_Set(command[0]);
		//load remaining bytes of the command
		for(int i = 1; i<tsize; i++){
			tx_buffer = ASM_SPI_TXDR_Set(command[i]);
		}
		//next command index
		cmd_index = cmd_index + 1;
		//pause
		for(volatile int i=0; i<100; i++);
		//start the transfer (clocks begin for TSIZE frames)
		ASM_SPI_CR1_CSTART_1();

		//		slave_ready = GPIOC_IDR_RDY_GET();
		//		if (slave_ready != 2){
		//
		//			//pre-load first byte of the command
		//			tx_buffer = ASM_SPI_TXDR_Set(command[0]);
		//			//load remaining bytes of the command
		//			for(int i = 1; i<tsize; i++){
		//				tx_buffer = ASM_SPI_TXDR_Set(command[i]);
		//			}
		//			//next command index
		//			cmd_index = cmd_index + 1;
		//			//pause
		//			for(volatile int i=0; i<100; i++);
		//			//start the transfer (clocks begin for TSIZE frames)
		//			ASM_SPI_CR1_CSTART_1();
		//
		//			slave_ready = 2;
		//		}
		//		else{
		//			printf("...lora busy...\n");
		//		}
	}

	while(ASM_SPI_SR_Get() & (0x1U)){
		//printf("RXP: Rx-packet available. 1: RxFIFO contains at least one data packet\n");
		rx_buffer = ASM_SPI_RXDR_Get();
	}

	if(ASM_SPI_SR_Get() & (0x1U << 6)){
		//printf("OVR: Bit 6 OVR: overrun.\n");
		ASM_SPI_RXDR_Get(); //clear RxFIFO
		ASM_SPI_IFCR_OVRC();
	}

	if(ASM_SPI_SR_Get() & (0x1U << 4)){
		//printf("TXTF: transmission transfer filled. 1: TxFIFO upload is finished.\n");
		ASM_SPI_IFCR_TXTFC();
	}
}

void EXTI15_IRQHTandler(){
	printf("Inside EXTI 15 interrupt\n");
	EXTI_RPR1_15_SET();  //to clear bit
}

void RCC_init(){

	ASM_RCC_CR_HSI16();
	while(!ASM_RCC_CR_HSI16RDY());

//	ASM_RCC_PLL1CFGR_PLL1SRC_HSI16();
//	ASM_RCC_PLL1CFGR_PLL1M_3();
//	ASM_RCC_PLL1DIVR_PLL1N_4();
//	ASM_RCC_PLL1CFGR_PLL1REN();
//	ASM_RCC_PLL1CFGR_PLL1PEN();
//	ASM_RCC_PLL1CFGR_PLL1QEN();
//
//
//	ASM_RCC_CR_PLL1();
//	while(!ASM_RCC_CR_PLL1RDY());

	//Activate MCO gpio pin PA8
	ASM_RCC_AHB2ENR1_GPIOAEN_Set();
	GPIOA_MODER_Set_Alt_Function();
	GPIOA_AFRH_Set_Alt_Function();
	GPIOA_OSPEEDR_Set();


	uint8_t msik_range = 4;
	ASM_RCC_ICSCR1_MSIKRANGE_SET(msik_range);
	ASM_RCC_ICSCR1_MSIRGSEL_1();

	// Read clock frequency

	ASM_RCC_CFGR1_MCOSEL_HSI16();
	//ASM_RCC_CFGR1_MCOSEL_HSI48();
	//ASM_RCC_CFGR1_MCOSEL_SYSCLK();
	//ASM_RCC_CFGR1_MCOSEL_MSIK();
	//ASM_RCC_CFGR1_MCOSEL_MSIS();
	//ASM_RCC_CFGR1_MCOSEL_HSE();
	//ASM_RCC_CFGR1_MCOSEL_PLL1();

	//ASM_RCC_CFGR1_SW_PLL1();
	//while(!(ASM_RCC_CFGR1_SWS() & 0x3U));
}

void GPIO_SPI_init(){

	ASM_RCC_AHB2ENR1_GPIOEEN_Set();
	ASM_RCC_AHB2ENR1_GPIOCEN_Set();


	//Configure GPIOE
	GPIOE_MODER_Set_Alt_Function();
	GPIOE_AFRH_Set_Alt_Function();
	GPIOE_OSPEEDR_Set();
  //GPIOE_PUPDR_Set();

  //GPIOE_PUPDR_MOSI_UP();
    GPIOE_PUPDR_MOSI_DOWN();
	GPIOE_PUPDR_MISO_UP();
  //GPIOE_PUPDR_MISO_DOWN();

  //** GPIO_PUPDR_SCK register bit value gets overwritten by SPI_CPOL bit (clock polarity)
  //GPIOE_PUPDR_SCK_UP();
  //GPIOE_PUPDR_CLEAR(26);
  //GPIOE_PUPDR_SCK_DOWN();

	GPIOE_MODER_NSS_Output();
	GPIOE_OSPEEDR_NSS_HIGH();
	GPIOE_BSRR_NSS_SET();

  //** GPIOE_PUPDR_NSS register bit value gets overwritten by SPI_SSIOP bit (SS input/output polarity)
	//GPIOE_PUPDR_NSS_UP();
  //GPIOE_PUPDR_NSS_DOWN();

	//Configure GPIOC for RDY
	//Configure GPIOC for RDY
	// PC1
	GPIOC_MODER_Input();

	//lock
//	GPIOC_LCKR_PIN1_LCKK_0();
//	GPIOC_LCKR_PIN1_LCKK_1();
//	GPIOC_LCKR_PIN1_LCKK_0();
//	GPIOC_LCKR_PIN1_LCKK_1();



}

void DIO_EXTI_init(){

	//PD15 for DIO1
	ASM_RCC_AHB2ENR1_GPIODEN_Set();

	GPIOD_MODER_DIO_INPUT();
	GPIOD_PUPDR_DIO_NPUPD();
	//GPIOD_PUPDR_DIO_DOWN();
	//GPIOD_PUPDR_DIO_UP();

	//EXTI rising edge enable bit
	EXTI_RTSR1_15_SET();
	//EXTI port selection
	EXTI_EXTICR15_DPORT();
	//EXTI interrupt mask bit
	EXTI_IMR1_15_SET();

}

void SPI_init(){
	//ASM_RCC_CCIPR1_SPI1SEL_PCLK2();
	//ASM_RCC_CCIPR1_SPI1SEL_SYSCLK();
	ASM_RCC_CCIPR1_SPI1SEL_HSI16();
	//ASM_RCC_CCIPR1_SPI1SEL_MSIK();
	//ASM_RCC_CFGR2_HPRE_2();
	//ASM_RCC_CFGR2_PCLK2_2();
	ASM_RCC_APB2ENR_SPI1_Set();
    ASM_SPI_CFG2_SSM_1();	//external NSS pin is disconnected from the SPI peripheral's internal SS logic, external pin is treated as GPIO
    ASM_SPI_CR1_SSI_1();	//force internal NSS high -> no MODF fault
    ASM_SPI_CFG2_SSOE_0();  //do not try to output via hardware NSS.
    ASM_SPI_CFG2_MASTER_Set();

    ASM_SPI_CFG2_MIDI_Set(4);
    ASM_SPI_CFG2_MSSI_Set(4);

    ASM_SPI_CFG2_COMM_Full_Duplex();
	ASM_SPI_CFG2_CPOL_0();
	ASM_SPI_CFG2_CPHA_0();
	ASM_SPI_CFG1_DSIZE_8();

	//baut rate
	ASM_SPI_CFG1_MBR_256();
	ASM_SPI_CFG1_BPASS_1();
	//ASM_SPI_CFG1_BPASS_0();

	//ASM_SPI_CFG2_LSBFRST_MSB();
	ASM_SPI_CFG2_LSBFRST_LSB();

	ASM_SPI_IER_EOTIE_Set();
	ASM_SPI_IER_TXPIE_Set();
	ASM_SPI_IER_TXTFIE_Set();
	ASM_SPI_IER_RXPIE_Set();

	ASM_SPI_CR1_SPE_0();
}

void TIM8_init(){

	ASM_RCC_APB2ENR_TIM8EN_Set();
	//configure TIM2 timer
	TIM8_Set_PSC_Value();
	TIM8_Set_ARR_Value();
	TIM8_Clear_UIF_Flag();
	TIM8_Set_CCnS_To_Channel_Output();
	TIM8_Set_DITHEN_False();
	TIM8_Set_CCRn_WaveGen_Value();
	TIM8_Set_DIR_UpCounter();
	TIM8_Set_MMS_Update_Trigger_Output();
	//TIM8_Set_OCnM_To_Toggle_Mode();
	TIM8_Set_CC1P_Polarity_ActiveHigh();
	TIM8_Set_CCnE_Output_Enable_To_GPIO();
	TIM8_Set_UIF_Update_Interrupt_Enable();
	TIM8_Set_CC1IE_Update_Interrupt_Enable();
}

void TIM8_start(){
	TIM8_Set_CEN_Counter_Enable();
	//RUN_COUNTER();
}

void TIM8_UP_IRQHandler(){
	if(TIM8_Get_SR_Status() & 0x1){  //UIF ON
		TIM8_Clear_UIF_Flag();
		timer_pulse ^= 1;
		//printf("%i \n", timer_pulse);
	}
}

/*
SetStandby()
SetPacketType()
SetRfFrequency()
SetPaConfig()	GPIOE_BSRR_NSS_RESET();
	for(int i=0; i<10; i++){}
SetTxParams(...)
SetBufferBaseAddress(...)
WriteBuffer(...)
SetModulationParams(...)
SetPacketParams(...)
SetDioIrqParams(...)
WriteReg(...)
SetTx()



//SetPacketType(...)	GPIOE_BSRR_NSS_RESET();
	for(int i=0; i<10; i++){}
Lora | FSK

//SetModulationParams(...)
Modulation BandWidth (BW_L)
Spreading Factor (SF)
Coding Rate (CR)
Low Data Rate Optimization (LDRO)


//SetPacketParams(...)


*/
